/***************************************************************************
**   					             大连理工大学 凌BUG战队
**   					               凌以青云，翥以极心!
**-------------------------------------------------------------------------
** 项    目：   robo_template
** 文 件 名：   InertialSensor_Backend.cpp
** 文件说明：   IMU Backend基类
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     季献淏     	   2022-07-09
**	 1.1							   补充注释						     赵钟源     	   2022-12-10
***************************************************************************/

#include "InertialSensor_Backend.h"

InertialSensor_Backend::InertialSensor_Backend(InertialSensor &imu0) : imu(imu0)
{
}

/***********************************************************************
** 函 数 名： InertialSensor_Backend::correctAccel()
** 函数说明： 修正加速度数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InertialSensor_Backend::correctAccel(void)
{

}

/***********************************************************************
** 函 数 名： InertialSensor_Backend::correctGyro()
** 函数说明： 修正陀螺仪数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InertialSensor_Backend::correctGyro(void)
{
//	gyro_calib = gyro;
  gyro_calib.x = gyro.x - gyro_offset.x;
  gyro_calib.y = gyro.y - gyro_offset.y;
  gyro_calib.z = gyro.z - gyro_offset.z;
}

/***********************************************************************
** 函 数 名： InertialSensor_Backend::publishAccel()
** 函数说明： 发布加速度数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InertialSensor_Backend::publishAccel(void)
{
  imu.accel[id] = accel;
}

/***********************************************************************
** 函 数 名： InertialSensor_Backend::publishAccel()
** 函数说明： 发布陀螺仪数据
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void InertialSensor_Backend::publishGyro(void)
{
  imu.gyro[id] = gyro_calib;
}

