/***************************************************************************
**   					             大连理工大学 凌BUG战队
**   					               凌以青云，翥以极心!
**-------------------------------------------------------------------------
** 项    目：   robo_template
** 文 件 名：   AHRS.cpp
** 文件说明：   姿态解算
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     林子涵     	   2022-07-18
**	 1.1							   补充注释						     赵钟源     	   2022-12-10
***************************************************************************/

#include "AHRS.h"

// 返回IMU四元数
Quaternion AHRS::getIMUQuat(void) const
{
  return imu_quat;
}

// 返回IMU欧拉角
Vector3f AHRS::getIMUEuler(void) const
{
  return imu_euler;
}

// 返回IMU坐标系
Matrix3f AHRS::getIMUCoordinateSystem(void) const
{
  return imu_coordinate_system; // C板基向量在世界坐标系中的坐标
}
