/***************************************************************************
**   					             大连理工大学 凌BUG战队
**   					               凌以青云，翥以极心!
**-------------------------------------------------------------------------
** 项    目：   robo_template
** 文 件 名：   RCProtocol_Backend.cpp
** 文件说明：   遥控器基类
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     季献淏     	     2022-07-18
**	 1.1							   补充注释						     赵钟源     	     2022-12-10
***************************************************************************/

#include "RCProtocol_Backend.h"

/***********************************************************************
** 函 数 名： RCProtocol_Backend::RCProtocol_Backend
** 函数说明： 构造函数，并完成引用变量rc_protocol初始化
**---------------------------------------------------------------------
** 输入参数： 引用变量rc_protocol0
** 返回参数： 无
***********************************************************************/
RCProtocol_Backend::RCProtocol_Backend(RCProtocol &rc_protocol0) : rc_protocol(rc_protocol0)
{

}

/***********************************************************************
** 函 数 名： RCProtocol_Backend::publishRCData
** 函数说明： 向前台上传结构体rc_data的成员数据
**---------------------------------------------------------------------
** 输入参数： rc_data
** 返回参数： 无
***********************************************************************/
void RCProtocol_Backend::publishRCData(RC_Data rc_data)
{
  rc_protocol.rc_data = rc_data;
}
