/***************************************************************************
**   					             大连理工大学 凌BUG战队
**   					               凌以青云，翥以极心!
**-------------------------------------------------------------------------
** 项    目：   robo_template
** 文 件 名：   Motor.cpp
** 文件说明：   Motor类
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     林子涵     	     2022-07-18
**	 1.1							   补充注释						     赵钟源     	     2022-12-10
***************************************************************************/

#include "Motor.h"
#include "Motor_RM.h"

/***********************************************************************
** 函 数 名： Motor::addBackend
** 函数说明： 添加电机backend
**---------------------------------------------------------------------
** 输入参数： Motor_Backend *backend
** 返回参数： ture or false
***********************************************************************/
bool Motor::addBackend(Motor_Backend *backend)
{
  if(!backend || backend_count >= MAX_MOTOR_BACKEND_NUM)
  {
    return false;
  }
  backend->id = backend_count;
  backends[backend_count++] = backend;
  backend->init();
  return true;
}


/***********************************************************************
** 函 数 名： Motor::init
** 函数说明： 
**---------------------------------------------------------------------
** 输入参数： Motor_Backend *backend
** 返回参数： 无
***********************************************************************/
void Motor::init(Motor_Backend *backend)
{

}

/***********************************************************************
** 函 数 名： Motor::update
** 函数说明： 轮询每个电机的更新函数，并判断数据是否有效
**---------------------------------------------------------------------
** 输入参数： timeus_t dT_us
** 返回参数： 无
***********************************************************************/
void Motor::update(timeus_t dT_us)
{
  for(uint16_t i = 0; i < backend_count; i ++)
  {
    valid[i] = backends[i]->update(dT_us);
  }
}
