/***************************************************************************
**   					             大连理工大学 凌BUG战队
**   					               凌以青云，翥以极心!
**-------------------------------------------------------------------------
** 项    目：   robo_template
** 文 件 名：   PIDControlTask.cpp
** 文件说明：   PID控制任务
**-------------------------------------------------------------------------
**						*修订*
**	*版本*							*修改内容*							*修改人*      			 *日期*
**	 1.0							   初始版本						     林子涵     	   2022-07-18
***************************************************************************/

#include "PIDControlTask.h"
#include "UARTDriver.h"

/***********************************************************************
** 函 数 名： PIDControlTask::update(timeus_t dT_us)
** 函数说明： 任务更新
**---------------------------------------------------------------------
** 输入参数： 更新时间间隔（us）
** 返回参数： 无
***********************************************************************/
void PIDControlTask::update(timeus_t dT_us)
{
  calculatePID(dT_us);

}

/***********************************************************************
** 函 数 名： PIDControlTask::init()
** 函数说明： 任务初始化
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void PIDControlTask::init()
{

}

/***********************************************************************
** 函 数 名： PIDControlTask::uninit()
** 函数说明： 任务反初始化
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void PIDControlTask::uninit(void)
{

}

void PIDControlTask::printPID(void)
{
  USART1_DMA_Debug_Printf("%-16f%-16f%-16f%-16f%-16f%-16f%-16f%-16f\r\n",
                      pid_controller.getPidData().feedback,
                      pid_controller.getPidData().d_feedback,
                      pid_controller.getPidData().expect	,
                      pid_controller.getPidData().d_expect,
                      pid_controller.getPidData().error,
                      pid_controller.getPidData().feedforward,
                      pid_controller.getPidData().out
                     );
}